snlkuharlocal/src/Documents/ЗаказИМ/ЗаказИМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказИМ</name>
  <registerRecords>AccumulationRegister.ОстаткиТМЦ</registerRecords>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаказаИМ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИнетЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛогистЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАвизации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>EnumRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентДоставки</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКомиссииДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>DocumentRef.ВозвратИМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Выкуп</name>
    <type>
      <types>DocumentRef.ВыкупИМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплата</name>
    <type>
      <types>DocumentRef.ОплатаИМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомиссияОплачена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВыкупа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказаОбщая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодтвержденныйЗаказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КачествоТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВозврат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоЗаказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <comment>Скидка %</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковокВозврат</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Возвраты</name>
    <attributes>
      <name>Возврат</name>
      <type>
        <types>DocumentRef.Возврат1ИМ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СтатусЗаказаИМ/СтатусЗаказаИМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗаказаИМ</name>
  <enumValues>
    <name>Формирование</name>
  </enumValues>
  <enumValues>
    <name>ПодготовкаКВыдаче</name>
  </enumValues>
  <enumValues>
    <name>ГотовоКВыдаче</name>
  </enumValues>
  <enumValues>
    <name>ПереданоВДоставку</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
  <enumValues>
    <name>СформированыДокументы</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденаОплата</name>
  </enumValues>
  <enumValues>
    <name>ОтказКлиента</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаказИМ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.  
	Движения.ОстаткиТМЦ.Очистить();
	////Движения.Продажи.Очистить();
	Движения.Записать(); 
	ЕстьДвижения = Ложь;
	//ЕстьДвижения1 = Ложь;         
	ПД = ПолучитьПД(КонтрагентДоставки);
	ВидДвиж = ВидДвиженияНакопления.Расход;
	////Если ((Статус = Перечисления.СтатусЗаказаИМ.ГотовоКВыдаче) ИЛИ (Статус = Перечисления.СтатусЗаказаИМ.ПереданоВДоставку) ИЛИ (Статус = Перечисления.СтатусЗаказаИМ.Обработка)) Тогда
	Если НЕ((Статус = Перечисления.СтатусЗаказаИМ.ОтказКлиента) ИЛИ (Статус = Перечисления.СтатусЗаказаИМ.ПодготовкаКВыдаче) ИЛИ (Статус = Перечисления.СтатусЗаказаИМ.Формирование) ИЛИ (Статус = Перечисления.СтатусЗаказаИМ.ГотовоКВыдаче)) Тогда
		ЕстьДвижения = Истина; 
	КонецЕсли; 
	////Если ((Статус = Перечисления.СтатусЗаказаИМ.ПереданоВДоставку) ИЛИ (Статус = Перечисления.СтатусЗаказаИМ.Обработка)) Тогда
	////	ЕстьДвижения1 = Истина;
	////КонецЕсли;
	Опер = ?(Статус = Перечисления.СтатусЗаказаИМ.ПереданоВДоставку, Перечисления.КодыОперацийОстатки.Перемещение, Перечисления.КодыОперацийОстатки.Реализация);
	Если ЕстьДвижения Тогда
		Движения.ОстаткиТМЦ.Записывать = Истина;
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Если ТекСтрокаТовары.ПодтвержденныйЗаказ Тогда
				Движение = Движения.ОстаткиТМЦ.Добавить();
				Движение.ВидДвижения = ВидДвиж;
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.Номенклатура = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
				//Движение.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
				Движение.Количество = ТекСтрокаТовары.ПодтвержденныйЗаказ;
				Движение.КодОперации = Опер;
				Движение.Отправитель = Подразделение;
				Движение.ПунктДоставки = ПД;
			КонецЕсли;
		КонецЦикла;
		
		Движения.Записать();
		
	КонецЕсли; 
	
	//Если стр.Номенклатура=справочники.Номенклатура.НайтиПоКоду("SNL-288462") тогда //Под.серт.ИМ 9999
	//		ДвижОстатки=Движения.ОстаткиТМЦ.ДобавитьРасход();
	//		движостатки.Количество=стр.Количество;
	//		движостатки.КодОперации=перечисления.КодыОперацийОстатки.Реализация;
	//		движостатки.Подразделение=Подразделение;
	//		движостатки.Склад=Склад;
	//		движостатки.Номенклатура=стр.Номенклатура;
	//		движостатки.Отправитель=контрагент;
	//		движостатки.Период=дата;
	//		движостатки.Регистратор=ссылка;
	//	Конецесли;
КонецПроцедуры

Функция ПолучитьПД(Контра)
	Рез = Неопределено;
	Запр = Новый Запрос;
	Запр.Текст =
	"ВЫБРАТЬ
	|	ПунктыДоставки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПунктыДоставки КАК ПунктыДоставки
	|ГДЕ
	|	ПунктыДоставки.Владелец = &Контра";
	Запр.УстановитьПараметр("Контра", Контра);
	Выб = Запр.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Рез = Выб.Ссылка;
	КонецЕсли;	
	Возврат Рез;
КонецФункции
